---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.NoUptoRoofForWall
source: html/840e2ae6-e8a4-4e2b-34d7-32026d2ccbd8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallJoinRoofFailures.NoUptoRoofForWall Property

Highlighted wall is set to be "Up to roof", however there is no roof above it that can be used.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoUptoRoofForWall { get; }
```